Feature: Търсене на предмети в домакинския инвентар

  Scenario: Успешно търсене по име
    Given потребителят иска да търси предмет
    When търси по име "Ориз"
    And натисне бутона за търсене
    Then системата връща резултат за търсене "Намерени са предмети"

  Scenario: Неуспешно търсене по несъществуващо име
    Given потребителят иска да търси предмет
    When търси по име "Несъществуващ предмет"
    And натисне бутона за търсене
    Then системата връща резултат за търсене "Няма намерени предмети"

  Scenario: Неуспешно търсене без въведено име
    Given потребителят иска да търси предмет
    When търси по име ""
    And натисне бутона за търсене
    Then системата връща резултат за търсене "Моля въведете име за търсене"

  Scenario: Успешно търсене по категория
    Given потребителят иска да търси предмет
    When търси по категория "Уреди"
    And натисне бутона за търсене
    Then системата връща резултат за търсене "Намерени са предмети"

  Scenario: Неуспешно търсене по празна категория
    Given потребителят иска да търси предмет
    When търси по категория ""
    And натисне бутона за търсене
    Then системата връща резултат за търсене "Моля въведете категория"